#+TITLE: CPP

** Character Sequences

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
#include <iostream>
#include <string>
using namespace std;

int main ()
{
  char question1[] = "What is your name? ";
  // question1 = "Wrong value"; arrays cannot be assigned values
  string question2 = "wrong value";
  question2 = "Where do you live? ";
  char answer1 [80];
  string answer2; cout << question1;
  cin >> answer1;
  cout << question2;
  cin >> answer2;
  cout << "Hello, " << answer1;
  cout << " from " << answer2 << "!\n";

  // Note that arrays cannot be assigned values
  return 0;
}
#+END_SRC

#+RESULTS:
| What is your name? Where do you live? Hello | è` from ! |

*** Examples

#+BEGIN_SRC cpp :flags -ggdb -std=c++17 -pthread :results raw
  #include <iostream>
  #include <memory>
  #include <thread>
  #include <chrono>
  #include <mutex>

  struct Base
  {
      Base() { std::cout << "  Base::Base()\n"; }
      // Note: non-virtual destructor is OK here
      ~Base() { std::cout << "  Base::~Base()\n"; }
  };

  struct Derived: public Base
  {
      Derived() { std::cout << "  Derived::Derived()\n"; }
      ~Derived() { std::cout << "  Derived::~Derived()\n"; }
  };

  void thr(std::shared_ptr<Base> p)
  {
      std::this_thread::sleep_for(std::chrono::seconds(1));
      std::shared_ptr<Base> lp = p; // thread-safe, even though the
                                    // shared use_count is incremented
      {
          static std::mutex io_mutex;
          std::lock_guard<std::mutex> lk(io_mutex);
          std::cout << "local pointer in a thread:\n"
                    << "  lp.get() = " << lp.get()
                    << ", lp.use_count() = " << lp.use_count() << '\n';
      }
  }

  int main()
  {
      std::shared_ptr<Base> p = std::make_shared<Derived>();

      std::cout << "Created a shared Derived (as a pointer to Base)\n"
                << "  p.get() = " << p.get()
                << ", p.use_count() = " << p.use_count() << '\n';
      std::thread t1(thr, p), t2(thr, p), t3(thr, p);
      p.reset(); // release ownership from main
      std::cout << "Shared ownership between 3 threads and released\n"
                << "ownership from main:\n"
                << "  p.get() = " << p.get()
                << ", p.use_count() = " << p.use_count() << '\n';
      t1.join(); t2.join(); t3.join();

      std::cout << "All threads completed, the last one deleted Derived\n";
  }
#+END_SRC

#+RESULTS:
Base::Base()
  Derived::Derived()
Created a shared Derived (as a pointer to Base)
  p.get() = 0xda0c30, p.use_count() = 1
Shared ownership between 3 threads and released
ownership from main:
  p.get() = 0, p.use_count() = 0
local pointer in a thread:
  lp.get() = 0xda0c30, lp.use_count() = 4
local pointer in a thread:
  lp.get() = 0xda0c30, lp.use_count() = 4
local pointer in a thread:
  lp.get() = 0xda0c30, lp.use_count() = 2
  Derived::~Derived()
  Base::~Base()
All threads completed, the last one deleted Derived

*** Basics

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
#include <stdio.h>
#include <iostream>

using namespace std;

class Rectangle {
  // these are privates (default)
  int width, height;
public:
  void set_values (int,int);
  int area () {return width*height;};
};

void Rectangle::set_values(int x, int y) {
  width = x;
  height = y;
}

int main(int status, char** argv) {
  Rectangle rect;
  rect.set_values(10, 4);
  cout << "Area: " << rect.area() << endl;
}
#+END_SRC

#+RESULTS:
: Area: 40

**** Answer

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
  // classes and uniform initialization
  #include <iostream>
  using namespace std;

  class Circle {
    double radius{60};
  public:
    Circle(double r)
      : radius(r) //
    { }
    double circum() {return 2*radius*3.14159265;}
  };

  int main () {
    Circle foo (10.0);   // functional form
    Circle bar = 20.0;   // assignment init.
    Circle baz {30.0};   // uniform init.
    Circle qux = {40.0}; // POD-like

    cout << "foo's circumference: " << bar.circum() << '\n';
    return 0;
  }
#+END_SRC

#+RESULTS:
: foo's circumference: 125.664

**** Answer

#+BEGIN_SRC cpp :flags -ggdb -std=c++11 :results replace raw
  #include <iostream>
  using namespace std;

  class complx {
    double re, im;
  public:

    // default constructor
    complx() : re(0), im(0) { }

    // move constructor
    complx(const complx&& c) {
      cout << "Move Constructor Invoked" << endl;
    }

    // copy constructor
    complx(const complx& c) { re = c.re; im = c.im; }

    // constructor with default trailing argument
    complx( double r, double i = 0.0) { re = r; im = i; }

    void display() {
      cout << "re = "<< re << " im = " << im << endl;
    }
  };

  int main() {

    // initialize with complx(double, double)
    complx one(1);

    // initialize with a copy of one
    // using complx::complx(const complx&)
    complx two = one;

    // construct complx(3,4)
    // directly into three
    complx three = complx(3,4);

    // initialize with default constructor
    complx four;

    // complx(double, double) and construct
    // directly into five
    complx five = 5;

    complx six = move(five);

    one.display();
    two.display();
    three.display();
    four.display();
    five.display();
  }
#+END_SRC

#+RESULTS:
Move Constructor Invoked
re = 1 im = 0
re = 1 im = 0
re = 3 im = 4
re = 0 im = 0
re = 5 im = 0

This example illustrates explicit initialization
by constructor.

**** Answer

#+BEGIN_SRC cpp
  #include <iostream>

  int main() {
    int* set = new int[100];
    for (int i = 0; i < 100; i++) {
      set[i] = 10;
    }

    //use set[]
    delete [] set;

    // Notice the element hasn't changed. We've
    // just told the compiler that the runtime that
    // the resource is free to be reused.
    std::cout << "10th elem: " << set[10];
  }
#+END_SRC

#+RESULTS:
: 10th elem: 10

***** Answer

#+BEGIN_SRC cpp :flags -ggdb -std=c++11 :results raw
// CPP program to illustrate
// working of Virtual Functions
#include<iostream>
using namespace std;

class base
{
public:
    void fun_1() { cout << "base-1\n"; }
    virtual void fun_2() { cout << "base-2\n"; }
    virtual void fun_3() { cout << "base-3\n"; }
    virtual void fun_4() { cout << "base-4\n"; }
};

class derived : public base
{
public:
    void fun_1() { cout << "derived-1\n"; }
    void fun_2() { cout << "derived-2\n"; }
    void fun_4(int x) { cout << "derived-4\n"; }
};

int main()
{
    base *p;
    derived obj1;
    p = &obj1;

    // Early binding because fun1() is non-virtual
    // in base
    p->fun_1();

    // Late binding (RTP)
    p->fun_2();

    // Late binding (RTP)
    p->fun_3();

    // Late binding (RTP)
    p->fun_4();

    // Early binding but this function call is
    // illegal(produces error) becasue pointer
    // is of base type and function is of
    // derived class
    //p->fun_4(5);
}
#+END_SRC

#+RESULTS:
base-1
derived-2
base-3
base-4
base-1
derived-2
base-3
base-4
print derived class
show base class

**** Intro

#+BEGIN_SRC cpp :flags -ggdb -std=c++11 :results raw
#include <iostream>

struct B { int n; };
class X : public virtual B {};
class Y : public virtual B {};
class Z : public B {};
// every object of type AA has one X, one Y, one Z, and two B's:
// one that is the base of Z and one that is shared by X and Y
struct AA : X, Y, Z {
    AA() {
        X::n = 1; // modifies the virtual B subobject's member
        Y::n = 2; // modifies the same virtual B subobject's member
        Z::n = 3; // modifies the non-virtual B subobject's member

        std::cout << X::n << Y::n << Z::n << '\n'; // prints 223
    }
};

int main()
{
  AA aa;
}
#+END_SRC

#+RESULTS:
223

*** Inheritence

#+BEGIN_SRC cpp :flags -ggdb -std=c++11 :results raw
#include <iostream>

class Base
{
    public:
      int a;
    protected:
      int b;
    private:
      int c;
};

class Derived:private Base   //Not mentioning private is OK because for classes it  defaults to private
{
    public:
      int d{10};
      void doSomething()
      {
          a = 10;  // Allowed
          b = 20;  // Allowed
          // c = 30;  // Not Allowed, Compiler Error
      }
};

class Derived2:public Derived
{
    void doSomethingMore()
    {
        // a = 10;  //Not Allowed, Compiler Error, a is private member of Derived now
        // b = 20;  //Not Allowed, Compiler Error, b is private member of Derived now
        // c = 30;  //Not Allowed, Compiler Error
    }
};

int main()
{
    Derived obj;
    obj.d = 11;
    std::cout << obj.d << std::endl;
    // obj.a = 10;  //Not Allowed, Compiler Error
    // obj.b = 20;  //Not Allowed, Compiler Error
    // obj.c = 30;  //Not Allowed, Compiler Error

}
#+END_SRC

#+RESULTS:
11
11
10

*** Array Construction :drill:
    :PROPERTIES:
    :ID:       e62e88c6-90a3-4885-933e-008189d25426
    :END:

Write a program that sums up elements in a multi-dimentional array.

#+BEGIN_SRC cpp :flags -ggdb -std=c++11 :results raw
  #include <iostream>
  using namespace std;

  int main () {
    int jimy[2][2] = {{1, 2}, {3, 4}};
    int sum = 0;
    for (int i = 0; i < 2; i++) {
      for (int j = 0; j < 2; j++) {
        sum += jimy[i][j];
      }
    }
    cout << "sum: " << sum << endl;
    // Note
    cout << "this is not out of bounds: " << jimy[5][0] << endl;
  }
#+END_SRC

#+RESULTS:
sum: 10
this is not out of bounds: 0

**** Answer

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
#include <stdlib.h>
#include <iostream>

using namespace std;
/*
 not that passing by reference is often more efficient because
 otherwise a copy of the argument is created every call.
 */
inline string cat (const string& a, const string& b) {
  return a+b;
}

int main () {
  cout << cat("hello", " world");
}
#+END_SRC

#+RESULTS:
: hello world

**** Answer

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
#include <iostream>
#include <array>
using namespace std;

int main()
{
  array<int,3> myarray {10,20,30};

  for (int i=0; i<myarray.size(); ++i)
    ++myarray[i];

  for (int elem : myarray)
    cout << elem << '\n';

  // This doesn't fail
  cout << myarray[4] << endl;
}
#+END_SRC

#+RESULTS:
|      11 |
|      21 |
|      31 |
| 4197168 |

** Namespace Aliasing

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
#include <iostream>

namespace alias = std;

int main () {
  alias::cout << "Hello World" << alias::endl;
  return 0;
}
#+END_SRC

#+RESULTS:
: Hello World

** Namespaces

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
#include <iostream>
using namespace std;

namespace foo
{
  int value() { return 5; }
}

namespace bar
{
  const double pi = 3.1416;
  double value() { return 2*pi; }
}

int main () {
  cout << foo::value() << '\n';
  cout << bar::value() << '\n';
  cout << bar::pi << '\n';
  return 0;
}
#+END_SRC

#+RESULTS:
|      5 |
| 6.2832 |
| 3.1416 |

** Overloads

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
  // overloading functions
  #include <iostream>
  using namespace std;

  int operate (int a, int b)
  {
    return (a*b);
  }

  // Overload type
  double operate (double a, double b)
  {
    return (a/b);
  }

  // Arity overload
  double operate (int a, int b, int c) {
    return operate(operate(a, b), c);
  }

  int main ()
  {
    int x=5,y=2;
    double n=6.0,m=2.0;
    cout << operate(x,y) << '\n';
    cout << operate(n,m) << '\n';
    cout << operate(x,y,y) << '\n';
    return 0;
  }
#+END_SRC

#+RESULTS:
| 10 |
|  3 |
| 20 |

** Pointer Arithmatic

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
// more pointers
#include <iostream>
using namespace std;

/*
  memory can be thought of as an array of bytes where each
  address is an index in the array and holds 1 byte
 */

int main ()
{
  // pointers have their own arithmetic.
  int numbers[5];
  int * p;
  int * p2;
  p = numbers;
  *p = 10;
  cout << p << endl;
  p2 = p;
  p++;  *p = 20;
  cout << p - p2 << endl;
  // cast to long because 64-bit memory architecture.
  cout << (long) p - (long) p2 << endl;
  cout << p << endl;
  p = &numbers[2];  *p = 30;
  cout << p << endl;
  p = numbers + 3;  *p = 40;
  cout << p << endl;
  p = numbers;  *(p+4) = 50;
  cout << p << endl;
  return 0;
}

#+END_SRC

#+RESULTS:
| 0x7fffa05a8c90 |
|              1 |
|              4 |
| 0x7fffa05a8c94 |
| 0x7fffa05a8c98 |
| 0x7fffa05a8c9c |
| 0x7fffa05a8c90 |

** Pointers and Arrays

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
// more pointers
#include <iostream>
using namespace std;

int main ()
{
  int numbers[5];
  int * p;
  p = numbers;
  *p = 10;
  p++;  *p = 20;
  p = &numbers[2];  *p = 30;
  p = numbers + 3;  *p = 40;
  p = numbers;  *(p+4) = 50;
  for (int n=0; n<5; n++)
    cout << numbers[n] << ", ";
  return 0;
}
#+END_SRC

#+RESULTS:
| 10 | 20 | 30 | 40 | 50 |

** Pointers

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
#include <iostream>
using namespace std;

int main () {
  // & is the Address-of opertor
  // * is the dereference (Value-of) operator
  int myvar = 25;
  int* foo = &myvar;
  cout <<  "Address of foo: " << foo << endl; // Address
  cout << "Value of foo: " << *foo << endl;

  *foo=40;
  cout <<  "Address of foo: " << foo << endl; // Address
  cout << "Value of foo: " << *foo << endl;
}
#+END_SRC

#+RESULTS:
| Address | of | foo: | 0x7ffcd5a4a2cc |
| Value   | of | foo: |             25 |
| Address | of | foo: | 0x7ffcd5a4a2cc |
| Value   | of | foo: |             40 |

** Scope

#+BEGIN_SRC cpp :flags -ggdb -std=c++17
// inner block scopes
#include <iostream>
using namespace std;

int main () {
  int x = 10;
  int y = 20;
  {
    int x;   // ok, inner scope.
    x = 50;  // sets value to inner x
    y = 50;  // sets value to (outer) y
    cout << "inner block:\n";
    cout << "x: " << x << '\n';
    cout << "y: " << y << '\n';
  }
  cout << "outer block:\n";
  cout << "x: " << x << '\n';
  cout << "y: " << y << '\n';
  return 0;
}
#+END_SRC

#+RESULTS:
| inner | block: |
| x:    |     50 |
| y:    |     50 |
| outer | block: |
| x:    |     10 |
| y:    |     50 |

** Stringstream

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
#include <iostream>
#include <sstream>
using namespace std;

int main() {
  stringstream ss1;
  ss1 << "SS1";
  cout << ss1.str() << endl;
  cout << (ss1.str() == ss1.str()) << endl;

  stringstream ss2;
  ss2 << "SS2";
  // Completely bizarre swap operation
  ss1.swap(ss2);
  cout << "ss1: " << ss1.str() << endl;
  cout << "ss2: " << ss2.str() << endl;

  // Read out of it.
  char* buff = new char [3];
  int length = 2;
  ss1.read(buff, length);
  cout << buff << endl;
}
#+END_SRC

#+RESULTS:
| SS1  |     |
| 1    |     |
| ss1: | SS2 |
| ss2: | SS1 |
| SS   |     |

** Structs

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
  // example about structures
  #include <iostream>
  #include <string>
  #include <sstream>
  using namespace std;

  struct Product {
    static void f();
    int weight;
    double price;
    static string store;
  };

  // Define static member function.
  void Product::f()
  {
    store = "Walmart";
  }

  string Product::store = "Walmart";


  int main() {
    Product apple;
    // Cannot be assigned dynamically:
    // string Product::store = "Walmart";
    apple.weight = 20;
    apple.price = 10.5;
    cout << apple.weight << endl;
    cout << apple.price << endl;
    cout << apple.store << endl;
  }
#+END_SRC

#+RESULTS:
|      20 |
|    10.5 |
| Walmart |

** Templates

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
// overloaded functions
#include <iostream>
using namespace std;

template<class T>
T sum (T a, T b)
{
  T ret = a + b;
  return ret;
}

template<class T, class U>
T sum(T a, U b) {
  return (a+b);
}

int main ()
{
  cout << sum<double>(10.5,20) << '\n';
  cout << sum<int>(10.5,20) << '\n';
  cout << sum<int, double>(10.5, 30) << '\n';
  cout << sum<double, int>(10.5, 30);
  return 0;
}
#+END_SRC

#+RESULTS:
| 30.5 |
|   30 |
|   40 |
| 40.5 |

** Unions

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
#include <iostream>
using namespace std;


// Named
struct book1_t {
  char title[50];
  char author[50];
  union {
    float dollars;
    int yen;
  } price;
};

// anonymous
struct book2_t {
  char title[50];
  char author[50];
  union {
    float dollars;
    int yen;
  };
};

int main() {
  book1_t book1;
  book2_t book2;
  book1.price.dollars = 10.0;
  book2.dollars = 10.0; // Ananymous unioins next
  cout << book1.price.dollars << endl;
  cout << book2.dollars << endl;
}
#+END_SRC

#+RESULTS:
| 10 |
| 10 |

** Using

#+BEGIN_SRC cpp :flags -ggdb -std=c++11
// using
#include <iostream>
using namespace std;

namespace first
{
  int x = 5;
  int y = 10;
}

namespace second
{
  double x = 3.1416;
  double y = 2.7183;
}

int main () {
  {
    using namespace first;
    cout << x << '\n';
    cout << y << '\n';
  }
  // Not valid because namespace was declared in different scope.
  // cout << x << '\n';
  cout << second::x << '\n';
  cout << second::y << '\n';
  return 0;
}
#+END_SRC

#+RESULTS:
|      5 |
|     10 |
| 3.1416 |
| 2.7183 |

**** Answer

#+BEGIN_SRC cpp :results raw
#include <iostream>
using namespace std;

int main()
{
   cout << "\n\n Find Size of fundamental data types :\n";
 	 cout << "------------------------------------------\n";
   cout << " The sizeof(char) is :          " << sizeof(char) << " bytes \n" ;
   cout << " The sizeof(short) is :         " << sizeof(short) << " bytes \n" ;
   cout << " The sizeof(int) is :           " << sizeof(int) << " bytes \n" ;
   cout << " The sizeof(long) is :          " << sizeof(long) << " bytes \n" ;
   cout << " The sizeof(long long) is :     " << sizeof(long long) << " bytes \n";
   cout << " The sizeof(float) is :         " << sizeof(float) << " bytes \n" ;
   cout << " The sizeof(double) is :        " << sizeof(double) << " bytes \n";
   cout << " The sizeof(long double) is :   " << sizeof(long double) << " bytes \n";
   cout << " The sizeof(bool) is :          " << sizeof(bool) << " bytes \n\n";
   return 0;
}
#+END_SRC

#+RESULTS:
Find Size of fundamental data types :
------------------------------------------
 The sizeof(char) is :          1 bytes
 The sizeof(short) is :         2 bytes
 The sizeof(int) is :           4 bytes
 The sizeof(long) is :          8 bytes
 The sizeof(long long) is :     8 bytes
 The sizeof(float) is :         4 bytes
 The sizeof(double) is :        8 bytes
 The sizeof(long double) is :   16 bytes
 The sizeof(bool) is :          1 bytes

**** Answer

#+BEGIN_SRC cpp :results raw
#include <iostream>
#include <climits>   // integer limits in header file
using namespace std;

int main()
{
    cout << "\n\n Check the upper and lower limits of integer :\n";
	cout << "--------------------------------------------------\n";
	cout << " The maximum limit of int data type :                  " << INT_MAX << endl;
	cout << " The minimum limit of int data type :                  " << INT_MIN << endl;
	cout << " The maximum limit of unsigned int data type :         " << UINT_MAX << endl;
	cout << " The maximum limit of long long data type :            " << LLONG_MAX << endl;
	cout << " The minimum limit of long long data type :             " << LLONG_MIN << endl;
	cout << " The maximum limit of unsigned long long data type :   " << ULLONG_MAX << endl;
	cout << " The Bits contain in char data type :                  " << CHAR_BIT << endl;
	cout << " The maximum limit of char data type :                 " << CHAR_MAX << endl;
	cout << " The minimum limit of char data type :                 " << CHAR_MIN << endl;
	cout << " The maximum limit of signed char data type :          " << SCHAR_MAX << endl;
	cout << " The minimum limit of signed char data type :          " << SCHAR_MIN << endl;
	cout << " The maximum limit of unsigned char data type :        " << UCHAR_MAX << endl;
	cout << " The minimum limit of short data type :                " << SHRT_MIN << endl;
    cout << " The maximum limit of short data type :                " << SHRT_MAX << endl;
    cout << " The maximum limit of unsigned short data type :       " << USHRT_MAX << endl;
   cout << endl;
   return 0;
}
#+END_SRC

#+RESULTS:
Check the upper and lower limits of integer :
--------------------------------------------------
 The maximum limit of int data type :                  2147483647
 The minimum limit of int data type :                  -2147483648
 The maximum limit of unsigned int data type :         4294967295
 The maximum limit of long long data type :            9223372036854775807
 The minimum limit of long long data type :             -9223372036854775808
 The maximum limit of unsigned long long data type :   18446744073709551615
 The Bits contain in char data type :                  8
 The maximum limit of char data type :                 127
 The minimum limit of char data type :                 -128
 The maximum limit of signed char data type :          127
 The minimum limit of signed char data type :          -128
 The maximum limit of unsigned char data type :        255
 The minimum limit of short data type :                -32768
 The maximum limit of short data type :                32767
 The maximum limit of unsigned short data type :       65535
Find Size of fundamental data types :
------------------------------------------
 The sizeof(char) is :          1 bytes
 The sizeof(short) is :         2 bytes
 The sizeof(int) is :           4 bytes
 The sizeof(long) is :          8 bytes
 The sizeof(long long) is :     8 bytes
 The sizeof(float) is :         4 bytes
 The sizeof(double) is :        8 bytes
 The sizeof(long double) is :   16 bytes
 The sizeof(bool) is :          1 bytes

**** Answer

#+BEGIN_SRC cpp :results raw
#include <iostream>
using namespace std;

int main()
{
    cout << "\n\n Check overflow/underflow during various arithmetical operation :\n";
    cout << " Range of int is [-2147483648, 2147483647]"<< endl;
	cout << "---------------------------------------------------------------------\n";
   int n1 = 2147483647;      // maximum range of integer
   cout <<" Overflow the integer range and set in minimum range : " << n1 + 1 << endl;
   cout <<" Increasing from its minimum range : " << n1 + 2 << endl;
   cout <<" Product is: " << n1 * n1 << endl;

   int n2 = -2147483648;     // minimum range of integer
   cout <<" Underflow the range and set in maximum range : " << n2 - 1 << endl;
   cout <<" Decreasing from its maximum range : " << n2 - 2 << endl;
   cout <<" Product is: " << n2 * n2 << endl;
   cout << endl;
   return 0;
}
#+END_SRC

#+RESULTS:
Check overflow/underflow during various arithmetical operation :
 Range of int is [-2147483648, 2147483647]
---------------------------------------------------------------------
 Overflow the integer range and set in minimum range : -2147483648
 Increasing from its minimum range : -2147483647
 Product is :1
 Underflow the range and set in maximum range : 2147483647
 Decreasing from its maximum range : 2147483646
 Product is : 0

**** Answer

#+BEGIN_SRC cpp :results raw
  #include <iostream>

  int main(int* argv)
  {
    int a = 10, b, c;
    c = a++;
    std::cout << "c = a++; // c = " << c << std::endl;
    b = ++a;
    std::cout << "b = ++a: // b = " << b << std::endl;
  }
#+END_SRC

#+RESULTS:
c = a++; // c = 10
b = ++a: // b = 12

**** Answer

#+BEGIN_SRC cpp :shebang #!/bin/bash
  #include <iostream>

  int main()
  {
    int a, b;
    std::cin >> a;
    std::cin >> b;
    std::cout << a + b;
  }
#+END_SRC

#+RESULTS:
: 1235923327

**** Answer

#+BEGIN_SRC cpp
  #include <iostream>

  int main()
  {
    int height=10, radius=3;
    double pi=3.14159265;
    double volume = (1.0/2.0) * pi * radius * radius * height;
    std::cout << "volume: " << volume;
  }
#+END_SRC

#+RESULTS:
: volume: 141.372

***** Answer

#+BEGIN_SRC cpp :results raw
  #include <iostream>
  int main() {
    std::cout << (bool) false << " " << (char) 10 << " " << (int) 10 << " " << (double) 12.2 << std::endl;
  }
#+END_SRC

#+RESULTS:
0 10 12.2

